#rkm09509님의 정수론 가이드

## 기본기 잡기

1. 정수 a,b가 있고 b가 0이 아닐 때 a = b*q+r 이고 0<=r<abs(b) 인 정수 q,r이 유일하게 존재한다. -> r을 a를 b로 나눈 나머지로 정의
   -> r=0인 경우, a와 b는 약수/배수 관계에 있음 -> 더 나아가 공약수, 공배수, 최대공약수, 최소공배수의 개념을 정의 가능


2. n>=2인 자연수 n이 2<=k<n인 k에 대해 약수가 없으면 자연수 n을 소수라고 정의한다 (=자기 자신과 1을 제외한 약수가 없는 자연수 n).
   소수가 아니면 (1제외) 합성수라고 정의한다.

3. 만약 두 정수 a,b를 n으로 나눈 나머지가 같다면,  a≡b(modn)라고 쓴다. mod 연산을 취하는 과정에서도 나눗셈을 제외한 사칙연산이 가능하다.
   나눗셈은 modular inverse의 개념을 배워야 mod연산을 취할 수 있다.

4. 대표적인 소수와 관련된 알고리즘들..
   1) 자연수가 소수임을 어떻게 판별할 것인가?
   2) 자연수의 약수의 개수를 어떻게 셀 것인가? 약수를 모두 찾으라고 한다면 어떻게 할 것인가?
   3) 자연수의 소인수분해를 어떻게 구할 것인가?
   4) 1부터 n까지의 소수를 어떻게 셀 것인가/구할 것인가?
  
   1,2,3에 대해서는 ${O(n)}$이라는게 알려져있다.
   자연수 n이 2이상 sqrt(n)이하의 자연수에 의해 나누어떨어지지 않는다면 n은 소수다.
   소수가 아니라면 ab = n인 2이상 n미만의 자연수 a,b가 존재, 둘다 sqrt(n)보다 크다면 ab>n

   1) 소수 판별 : 2이상 sqrt(n) 이하의 모든 자연수로 나누어떨어지지 않는다면 소수, 하나라도 나누어 떨어지면 합성수 (1제외)
   2) 약수 세기/찾기 : a가 n의 약수면 n/a도 n의 약수. 한 쪽은 sqrt(n)보다 작거나 같고 다른 한 쪽은 sqrt(n)보다 sqrt(n)이하의 약수 찾기.
   3) 소인수분해 : 2이상 sqrt(n)이하 모든 자연수를 순서대로 보자. 현재 보고있는 i가 n의 약수라면 n이 i의 배수가 아닐 때까지 n에서 i를 나누어준다. n==1일 때까지 위 과정 반복 아니면 마지막 n역시 소수
   4) 에라토스테네스의 체 : 2부터 n까지의 자연수를 순서대로 보면서 합성수인 것들을 지워내자. 현재 보고있는 값 p가 지워지지 않았다면 p는 소수이다. 이제 p의 배수를 지워내자. 이를 반복하는 것.
  
   5) 
      
